In [1]:
import pandas as pd
import numpy as np

### GROUP BY

To group and aggegrate data.

In [2]:
#Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [3]:
df = pd.DataFrame(data)

In [5]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [19]:
comp_group = df.groupby('Company')

In [7]:
comp_group.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [8]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [9]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [20]:
comp_group.describe().transpose()
comp_group.describe().transpose()[['GOOG']]

Company            GOOG
Sales count    2.000000
      mean   160.000000
      std     56.568542
      min    120.000000
      25%    140.000000
      50%    160.000000
      75%    180.000000
      max    200.000000

In [11]:
comp_group.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

## MISSING DATA

In [7]:
df2 = pd.DataFrame({'A' : [1,2,np.nan],
                   'B' : [5,np.nan,np.nan],
                   'C' : [1,2,3]})

In [8]:
df2

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [9]:
df2.isnull() #melihat yang nan dimana aja
df2.isnull().sum() #menghitung jumlah nan di masing-masing kolom

A    1
B    2
C    0
dtype: int64

In [10]:
df2.dropna() #menghapus baris yang ada missing value
#tidak permanen menghapusnya

     A    B  C
0  1.0  5.0  1

In [11]:
df2.dropna(axis=1) #menghapus kolom yang ada missing value
#axis = 1 menunjukkan kolom
#tidak permanen menghapusnya

   C
0  1
1  2
2  3

In [12]:
df2.dropna(thresh = 2)#threshold merupakan jumlah nilai missing value yang harus dipenuhi. apabila missing value 2 atau lebih makan akan dihapus

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [13]:
df2.fillna(value='FILL VALUE') #Masukin value 'FILL VALUE'ke data yg tadi Nan

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [15]:
df2.fillna(value=df2.mean()) #menampilkan df2 dan mengisi A yg nan dengan mean
#X['A']

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [ ]:
df2.fillna(method = 'ffill') #forward fill. dari atas ke bawah

In [ ]:
df2.fillna(method = 'bfill') #backward fill. dari bawah ke atas

## MERGING, JOINING, CONCATENATING

In [ ]:
df1 = pd.DataFrame({'A' : ['A0','A1','A2','A3'],
                   'B' : ['B0','B1','B2','B3'],
                   'C' : ['C0', 'C1','C2','C3'],
                   'D' : ['D0','D1','D2','D3',]})

In [ ]:
df2 = pd.DataFrame({'A' : ['A4','A5','A6','A7'],
                   'B' : ['B4','B5','B6','B7'],
                   'C' : ['C4','C5','C6','C7'],
                   'D' : ['D4','D5','D6','D7']}) #kalau index tidak dijabarkan default adalah dari 0

In [ ]:
print(df1)
print(df2)

### CONCATE
menggabungkan dua dataframe. nempelin aja. banyak kolom harus sama
Kalau nama kolom berbeda tidak bisa nempel. Akan ada 2 kolom berbeda. Ex : A, A1 -> [A,A1,B,C,D]

In [ ]:
pd.concat([df1,df2])

In [ ]:
pd.concat([df1,df2], axis=1) #menempelkan ke samping atau ke kolom 
#Kalau index sama tidak ada Nan

In [ ]:
pd.concat([df1,df2], axis=1) #Kalau beda index

## MERGING

Join di SQL = Merge di python. Kita akan menunjuk join/merge based on kolom tertentu.
join python menggabungkan berdasarkan index.

In [ ]:
left = pd.DataFrame({'key' : ['K0','K1','K2','K3'],
                    'A' : ['A0','A1','A2','A3'],
                    'B' : ['B0','B1','B2','B3']})
right = pd.DataFrame({'key' : ['K0','K1','K2','K3'],
                    'C' : ['C0','C1','C2','C3'],
                    'D' : ['D0','D1','D2','D3']})

pd.concat([left,right], axis=1)

In [ ]:
pd.merge(left,right, how='left', on='key')

how = inner, outer, left, right

In [ ]:
right1 = pd.DataFrame({'key' : ['K0','K1','K2'],
                    'C' : ['C0','C1','C2'],
                    'D' : ['D0','D1','D2']})

In [ ]:
print(pd.merge(left,right1, how='inner', on='key'))
print(pd.merge(left,right1, how='outer', on='key'))
print(pd.merge(left,right1, how='left', on='key'))
print(pd.merge(left,right1, how='right', on='key'))

## JOIN

Join tidak ada pilihan condition atau based on apa.
Merge lebih flexibel
Menggabungkan based on index
Index harus di declare

In [ ]:
kiri = pd.DataFrame({'A' : ['A0','A1','A2','A3'],
                    'B' : ['B0','B1','B2','B3']},
                    index = ['K0','K1','K2','K3'])
kanan = pd.DataFrame({'C' : ['C0','C1','C2','C3'],
                    'D' : ['D0','D1','D2','D3']},
                    index =['K0','K1','K2','K3'])

In [ ]:
kiri.join(kanan)

In [ ]:
kanan.join(kiri)